app/views/contrats/reporte.pdf.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <div class="societe">
    <% if @contrat.user.nomentreprise.present? %>