app/controllers/contratcdds_controller.rb

  def show
    @contratcdd = Contratcdd.find(params[:id])
---
SELECT  "contratcdds".* FROM "contratcdds" WHERE "contratcdds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @contratcdd = Contratcdd.new(contratcdd_params)
    @contratcdd.employee = Employee.find(params[:employee_id])


    respond_to do |format|
      if @contratcdd.save
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "contratcdds" ("created_at", "updated_at", "employee_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2017-11-12 16:08:21.950637"], ["updated_at", "2017-11-12 16:08:21.950637"], ["employee_id", 1]]