app/controllers/contrats_controller.rb

  def create
    @contrat = Contrat.new(contrat_params)
    @contrat.user = current_user

    respond_to do |format|
      if @contrat.save
---
INSERT INTO "contrats" ("nom", "prenom", "adresse", "created_at", "updated_at", "startdate", "societe", "nsiret", "cnaf", "sadresse", "sexerepresentant", "typesociete", "nomrepresentant", "prenomrepresentant", "posterepresentant", "numeroaffiliation", "regionurssaf", "adresseurssaf", "sville", "empcivilite", "birthplace", "birthdate", "nationalite", "permissejourexp", "permissejourdate", "permissejournum", "permissejourloc", "nsecu", "datefin", "nomposte", "dureeprobation", "probrationfin", "remuneration", "heures", "jour1", "jour2", "jour3", "jour4", "horaire1", "horaire2", "horaire3", "horaire4", "dureecontrat", "video", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45) RETURNING "id"

  def update
    respond_to do |format|
      if @contrat.update(contrat_params)
---
UPDATE "contrats" SET "jour1" = $1, "jour2" = $2, "jour3" = $3, "jour4" = $4, "jour5" = $5, "jour6" = $6, "jour7" = $7, "updated_at" = $8 WHERE "contrats"."id" = $9  [["jour1", "f"], ["jour2", "f"], ["jour3", "f"], ["jour4", "f"], ["jour5", "f"], ["jour6", "f"], ["jour7", "f"], ["updated_at", "2017-10-04 14:23:45.209494"], ["id", 1]]

  def destroy
    @contrat.destroy
---
DELETE FROM "contrats" WHERE "contrats"."id" = $1  [["id", 1]]

    def set_contrat
      @contrat = Contrat.find(params[:id])
---
SELECT  "contrats".* FROM "contrats" WHERE "contrats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]